Задачи с сайта sql-ex

1) Найдите номер модели, скорость и размер жесткого диска для всех ПК стоимостью менее 500 дол. Вывести: model, speed и hd

SELECT model, speed, hd
FROM pc
WHERE price < 500;
=======================

2) Найдите производителей принтеров. Вывести: maker

=======================

3) Найдите номер модели, объем памяти и размеры экранов ПК-блокнотов, цена которых превышает 1000 дол.

=======================

4) Найдите все записи таблицы Printer для цветных принтеров.

=======================

5) Найдите номер модели, скорость и размер жесткого диска ПК, имеющих 12x или 24x CD и цену менее 600 дол.

=======================

6) Для каждого производителя, выпускающего ПК-блокноты c объёмом жесткого диска не менее 10 Гбайт, найти скорости таких ПК-блокнотов. Вывод: производитель, скорость.

=======================

7) Найдите номера моделей и цены всех имеющихся в продаже продуктов (любого типа) производителя B (латинская буква).

=======================

8) Найдите производителя, выпускающего ПК, но не ПК-блокноты.

=======================

9) Найдите производителей ПК с процессором не менее 450 Мгц. Вывести: Maker

=======================

10) Найдите модели принтеров, имеющих самую высокую цену. Вывести: model, price

=======================